%以下代码适用于以特征数为行数，样本数为列数的数据
clear;
clc;
%常驻人口数
x1=[93.48 96.13 100.98 106.27 108.94 109.99 110.85 111.91 113.59 129.12 135.63 142.46 149.36 154.58];
%地区生产总值
x2=[1123.61 1284.61 1498.24 1623.17 1832.63 2441.75 2829.62 3206.57 2958.85 3714.57 4216.52 4601.5 5018.36 6103.69];
%社会消费品零售总额
x3=[210.33 240.23 279.07 322.68 384 457.27 542.28 593.79 649.04 670.9 737.11 803.87 810.4 866.73];
%游客
x4=[1157.2 1250.29 1185.37 1112.65 1276.8 1301.38 1324.36 1324.53 1393.46 1371.5 1359.4 1384 1359.33 1462.68];
%垃圾量
x0=[47.8 56 58.4 52.9 52.9 51.1 51.1 47.55 53.51 57.26 63.96 68.48 71.05 76.2];

%所有样本构成矩阵pre_data，共有14组样本，4个特征值
pre_data = [x1;x2;x3;x4];
%原始垃圾量数据
pre_gar = x0;

%对数据进行归一化处理
[data,ps1] = mapminmax(pre_data,0,1);%4*14的矩阵
[gar,ps2] = mapminmax(pre_gar,0,1);


%调用bp函数对模型训练，返回训练最终得到的w、b，y为模型最终模拟的垃圾数量
[y,w1,w2,b1,b2] = bp_function(data,gar);

%test_data为需要被预测的数据，其第一行数据对应常住人口数，第二行对应地区生产总值，第三行对应社会消费品总和，第四行对应游客数量    
test_data = [158.5 164.51 170.52 176.53 182.54 188.55 194.56 200.57 206.58 212.59 218.6 224.61 230.62 236.63 242.64 248.65 254.66 260.67 266.68 272.69;
5858.09 6264.52 6670.95 7077.38 7483.81 7890.24 8296.67 8703.1 9109.53 9515.96 9922.39 10328.82 10735.25 11141.68 11548.11 11954.54 12360.97 12767.4 13173.83 13580.26;
932.56 982.91 1033.26 1083.61 1133.96 1184.31 1234.66 1285.01 1335.36 1385.71 1436.06 1486.41 1536.76 1587.11 1637.46 1687.81 1738.16 1788.51 1838.86 1889.21;
1446.82 1463.51 1480.2 1496.89 1513.58 1530.27 1546.96 1563.65 1580.34 1597.03 1613.72 1630.41 1647.1 1663.79 1680.48 1697.17 1713.86 1730.55 1747.24 1763.93];

%test是一个测试矩阵，前十三列数据与训练数据后十三列数据相同，最后一列数据来自需要被预测矩阵的第一列数据，若要不断预测下一组数据，可编写一个循环对test矩阵重新赋值
test(:,1:13) = pre_data(:,2:end);
test(:,14) = test_data(:,1);
    
%对test矩阵进行归一化处理
[newdata,ps3] = mapminmax(test,0,1);

%调用预测函数进行预测
[newgar] = Predict_function(newdata,w1,w2,b1,b2);

%绘制曲线观测模型训练效果
x = [2001:1:2014];
xx = [2002:1:2015];
plot(x,gar,x,y,xx,newgar);
set(gca,'XTick',2001:1:2015);%设置横坐标刻度
grid;
legend('2001-2014 actual','train','2015 predict');%曲线标注
ylabel('垃圾数量');